const recipes = [
  {
    id: 1,
    name: "쌀미음",
    a1: "4~5개월",
    detail: "가장 기본적인 초기 이유식으로, 아기의 소화기관에 부담이 적습니다.",
    a2: "쌀 10g (밥 1큰술 정도), 물 100ml",
    a3: [
      "1. 쌀을 깨끗이 씻어 30분~1시간 정도 물에 불립니다.",
      "2. 불린 쌀을 믹서기에 넣고 물을 추가해 곱게 갈아줍니다.",
      "3. 간 쌀물을 냄비에 넣고 중약불에서 저어가며 끓입니다.",
      "4. 쌀알이 완전히 퍼지고 농도가 묽은 죽처럼 되면 완성입니다.",
      "(체에 한 번 걸러내면 더 부드럽게 만들 수 있습니다.)",
    ],
    a4: "좋음",
  },
  {
    id: 2,
    name: "애호박 미음",
    a1: "4~5개월",
    detail:
      "애호박은 소화가 잘 되고 알레르기 유발 가능성이 낮아 초기 이유식 재료로 적합합니다.",
    a2: "애호박 10g (작은 조각), 쌀가루 5g (1작은술), 물 50ml (10배 죽 비율)",
    a3: [
      "1. 애호박을 깨끗이 씻은 뒤 껍질을 벗기고 씨를 제거합니다.",
      "2. 적은 양(10g)만 준비하여 다진 후, 물에 살짝 데쳐주세요.",
      "3. 데친 애호박을 체에 걸러 곱게 만듭니다. (블렌더를 사용할 수도 있음)",
      "4. 쌀가루와 물을 냄비에 넣고 약한 불에서 저어가며 끓입니다.",
      "5. 완성된 쌀미음에 걸러놓은 애호박을 섞어줍니다.",
      "6. 필요하면 물을 약간 더 추가하여 부드럽고 묽게 만듭니다.",
    ],
    a4: "좋음",
  },
  {
    id: 3,
    name: "고구마 퓨레",
    a1: "4~5개월",
    detail: "고구마는 부드럽고 달콤해 아기들이 좋아하는 첫 채소 이유식입니다.",
    a2: "고구마 20g, 물 (삶을 때 사용)",
    a3: [
      "1. 고구마를 껍질째 씻고, 삶거나 찐 후 껍질을 벗깁니다.",
      "2. 삶은 고구마를 체에 걸러 곱게 으깹니다.",
      "3. 너무 퍽퍽하다 싶으면 분유물이나 생수를 약간 섞어 묽게 만들어줍니다.",
    ],
    a4: "좋음",
  },
  {
    id: 4,
    name: "배 퓨레",
    a1: "4~5개월",
    detail:
      "과일은 섬유질과 자연스러운 단맛을 제공합니다. 단, 너무 많이 주지 않도록 주의하세요.",
    a2: "잘 익은 배 20g(보통 큰거 반개),물 (필요시)",
    a3: [
      "1. 배의 껍질과 씨를 제거한 후 부드럽게 찌거나 끓는물에 1분 데친다.",
      "2. 배와 물과 함께 믹서기에 곱게 간다.",
      "3. 처음에는 물을 약간 섞어 묽게 만들어줍니다.",
    ],
    a4: "좋음",
  },
];

export default recipes;
